function superscript(_str) {
    const sup = {
        0:'⁰', 1:'¹', 2:'²', 3:'³', 4:'⁴', 5:'⁵', 6:'⁶', 7:'⁷', 8:'⁸', 9:'⁹',
        a:'ᵃ', b:'ᵇ', c:'ᶜ', d:'ᵈ', e:'ᵉ', f:'ᶠ', g:'ᵍ', h:'ʰ', i:'ⁱ', j:'ʲ', k:'ᵏ', l:'ˡ', m:'ᵐ', n:'ⁿ', o:'ᵒ', p:'ᵖ',        r:'ʳ', s:'ˢ', t:'ᵗ', u:'ᵘ', v:'ᵛ', w:'ʷ', x:'ˣ', y:'ʸ', z:'ᶻ',
        A:'ᴬ', B:'ᴮ',        D:'ᴰ', E:'ᴱ',        G:'ᴳ', H:'ᴴ', I:'ᴵ', J:'ᴶ', K:'ᴷ', L:'ᴸ', M:'ᴹ', N:'ᴺ', O:'ᴼ', P:'ᴾ',        R:'ᴿ',        T:'ᵀ', U:'ᵁ', V:'ⱽ', W:'ᵂ'                     ,
        α:'ᵅ', β:'ᵝ', γ:'ᵞ', δ:'ᵟ', ε:'ᵋ', ζ:'ζ', η:'η', θ:'ᶿ', ι:'ᶥ', κ:'κ', λ:'λ', μ:'μ', ν:'ν', ξ:'ξ', ο:'ο', π:'π', ρ:'ρ', σ:'σ', ς:'ς', τ:'τ', υ:'υ', φ:'ᶲ', ψ:'ᵠ', χ:'ᵡ', ω:'ω'
        // Α α, Β β, Γ γ, Δ δ, Ε ε, Ζ ζ, Η η, Θ θ, Ι ι, Κ κ, Λ λ, Μ μ, Ν ν, Ξ ξ, Ο ο, Π π, Ρ ρ, Σ σ/ς, Τ τ, Υ υ, Φ φ, Χ χ, Ψ ψ, and Ω ω.
        // ᵅ ᵝ ᵞ ᵟ ᵋ ᶿ ᶥ ᶲ ᵠ ᵡ
    }
    let str = '';
    for (let i = 0; i < _str.length; i++) {
        str += sup[_str[i]] || _str[i];
    }
    return str;
}

export default superscript;